Tekla Open API Reference for Tekla Structures 2025
SelfIntersectingSurfaceException Class
 This class represent an exception thrown when the an operation on a lofted plate has been determined to cause a self intersecting surface
Inheritance Hierarchy
System.Object
 System.Exception
 Tekla.Structures.Model.LoftedPlateOperationException
 Tekla.Structures.Model.SelfIntersectingSurfaceException
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class SelfIntersectingSurfaceException : LoftedPlateOperationException
Public Class SelfIntersectingSurfaceException
	Inherits LoftedPlateOperationException
The SelfIntersectingSurfaceException type exposes the following members.
Constructors
Name | Description
SelfIntersectingSurfaceException
 Constructs an instance of the class
Top
See Also
Reference
Tekla.Structures.Model Namespace